soa4-reqs/unloadReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="https://localhost:8080/api/v1/space-marines">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:unloadSpaceMarineRequest>
        <gs:spaceMarineId>6</gs:spaceMarineId>
        <gs:starshipId>1</gs:starshipId>
      </gs:unloadSpaceMarineRequest>
   </soapenv:Body>
</soapenv:Envelope>

